app/views/users/edit.html.erb

SELECT "positions".* FROM "positions" WHERE "positions"."user_id" = 2
---
	<% @all_positions.each do |position| %>
		<%= check_box_tag "positions[#{position}]", 1, @selected_positions.include?(position), :id => "positions_#{position}"%><%=position%>