app/views/users/index.html.erb

SELECT "positions".* FROM "positions"
---
	<% @all_positions.each do |position| %>
		<%= check_box_tag "positions[#{position}]", 1, @selected_positions.include?(position), :id => "positions_#{position}"%><%=position%>