app/views/events/show.html.erb

	<br>
	<% @event.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = 2