app/controllers/certificates_controller.rb

	def show
		@user = User.find params[:user_id]
		@certificate = Certificate.find params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "certificates".* FROM "certificates" WHERE "certificates"."id" = ? LIMIT 1  [["id", "2"]]

	def create
		@user = User.find(params[:user_id])
		@certificate = @user.certificates.build(params[:certificate])
		if @certificate.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "certificates" ("created_at", "expiration_date", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)

	def edit
		@user = User.find params[:user_id]
		@certificate = Certificate.find params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "certificates".* FROM "certificates" WHERE "certificates"."id" = ? LIMIT 1  [["id", "1"]]

	def update
		@user = User.find params[:user_id]
		@certificate = Certificate.find params[:id]
		@certificate.update_attributes!(params[:certificate])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "certificates".* FROM "certificates" WHERE "certificates"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "certificates" SET "name" = 'Driver License', "updated_at" = '2013-04-30 20:24:59.187585' WHERE "certificates"."id" = 1