app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "2"]]
---
	def add_user
		@event = Event.find(params[:event_id])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "2"]]
---
	def remove_user
		@event = Event.find(params[:event_id])

INSERT INTO "events" ("created_at", "end_at", "name", "start_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save