app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "positions".* FROM "positions"
SELECT "positions".* FROM "positions" WHERE "positions"."title" IN ('Paid_Driver', 'Driver', 'EMT', 'Medic', 'Stand_Bys')
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
---
	def index
		@users = User.all
		@positions = Position.all
		sort = params[:sort] || session[:sort]
		if sort == 'firstname'
			@users = User.order("first_name ASC")
		elsif sort == 'lastname'
			@users = User.order("last_name ASC")
		end
		@all_positions = Position.all_titles
		@selected_positions = params[:positions] || session[:positions] || {}

		if @selected_positions == {}
			@selected_positions = Hash[@all_positions.map {|position| [position, position]}]
		elsif @selected_positions != {}
			@users = []
			@positions = Position.find_all_by_title(@selected_positions.keys)
			@positions.each do |position|
				@users << User.find(position.user_id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "positions".* FROM "positions" WHERE "positions"."user_id" = 2
SELECT "certificates".* FROM "certificates" WHERE "certificates"."user_id" = 2
---
  def show
    id = params[:id] # retrieve user ID from URI route
    @user = User.find(id) # look up user by unique ID
    # will render app/views/user/profile.<extension> by default
		@positions = Position.find_all_by_user_id(id)
		@certification = Certificate.find_all_by_user_id(id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "positions".* FROM "positions" WHERE "positions"."user_id" = 2
---
  def edit
    @user = User.find params[:id]
		@positions = Position.find_all_by_user_id(@user.id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "first_name" = 'Helper', "last_name" = 'Role', "phone" = '123425554', "role" = 'helper', "updated_at" = '2013-05-03 20:37:46.709407' WHERE "users"."id" = 8
INSERT INTO "positions" ("created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 29 Apr 2013 01:17:41 UTC +00:00], ["title", "EMT"], ["updated_at", Mon, 29 Apr 2013 01:17:41 UTC +00:00], ["user_id", 2]]
SELECT "positions".* FROM "positions" WHERE "positions"."user_id" = 2 AND "positions"."title" = 'EMT' LIMIT 1
---
  def update
    @user = User.find params[:id]
    @user.update_attributes!(params[:user])
		# check if all params[:positions] are in the positions table
		# if not add them.
		@all_positions = Position.all_titles
		@pos = params[:positions] || []
		@positions = []
		@pos.each do |position|
			@positions << position[0]
		end
		@not_positions = @all_positions - @positions
		# adds all positions that do not exist for user
		@positions.each do |position|
			if Position.find_by_user_id_and_title(@user.id, position) == nil