app/controllers/weekly_controller.rb

SELECT "events".* FROM "events" WHERE (start_at between '2013-04-14' and '2013-04-21')
---
	def index
	@date = Time.now
	@start_date = Date.new(@date.year, @date.month, @date.day)
	@events = Event.find(:all, :conditions => ['start_at between ? and ?', @start_date, @start_date + 7])